Revit 2027 API
FabricArea.DistributionOfWiresAtCover Property
 The distribution of wires that is closest to the cover.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WireDistributionDirection DistributionOfWiresAtCover { get; set; }
Public Property DistributionOfWiresAtCover As WireDistributionDirection
	Get
	Set
public:
property WireDistributionDirection DistributionOfWiresAtCover {
	WireDistributionDirection get ();
	void set (WireDistributionDirection value);
}
member DistributionOfWiresAtCover : WireDistributionDirection with get, set
Property Value
WireDistributionDirection
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace